import React, { Component } from 'react';
import axios from "axios";
import { withRouter } from "react-router-dom";

import { BaseUrl } from '../baseUrl';

class Hotel extends Component {
    constructor(props) {
        super(props);
        this.hotelId = this.props.match.params.id

        this.state = {
            hotelInfo: [],
            rooms: []
        }

        axios.get(BaseUrl + 'hotels/hotel/' + this.hotelId)
            .then(res => {
                const hotelInfo = res.data;
                this.setState({ hotelInfo: hotelInfo });
            })

        axios.get(BaseUrl + 'hotels/hotel/' + this.hotelId + '/rooms')
            .then(res => {
                const rooms = res.data;
                this.setState({ rooms: rooms });
            })


    }

    componentDidMount() {


    }

    render() {
        console.log("rooms", this.state.rooms)
        if (!this.state.hotelInfo) {
            return ('در حال بارگزاری')
        }
        let stars = []
        for (let i = 0; i < parseInt(this.state.hotelInfo.stars); i++) {
            stars.push(<i className="fas fa-star hotel_item_star positive_star"></i>)
        }

        const noneStar = 5 - stars.length
        console.log("noneStar", stars.length)
        for (let i = 0; i < noneStar; i++) {
            stars.push(<i className="fas fa-star hotel_item_star"></i>)
        }

        let facilities = { ...this.state.hotelInfo.facilities }
        let public_spaces = facilities["public_spaces"]
        let customer_services = facilities["customer_services"]
        let foods_and_drinks = facilities["foods_and_drinks"]
        let sports = facilities["sports"]
        let breadcrumbs = this.state.hotelInfo.breadcrumbs;
        let rooms = this.state.hotelInfo.rooms;
        if (breadcrumbs) {
            breadcrumbs = breadcrumbs.join("/")
        }

        return (
            <div className="hotel_page_all_container">
                <div className="hotel_page_head_info_container">
                    <div className="hotel_page_title_container">
                        <p className="hotel_page_title">
                            {this.state.hotelInfo.name}
                        </p>
                        <div style={{ direction: "ltr", lineHeight: "0.5", display: "inline", marginRight: "20px" }}>
                            {stars}
                        </div>
                    </div>

                    <div className="hotel_page_title_address_container">
                        <a href="#location">
                            <p className="hotel_page_title_address">
                                {/* Asker Ocagi Cad. No:1 Taksim, Şişli, Istanbul, Turkey */}
                                {this.state.hotelInfo.address}
                            </p>
                        </a>
                    </div>
                </div>

                <div className="hotel_page_sub_all_container">

                    <div className="hotel_page_main_info_container">

                        <div className="hotel_page_gallery_container">

                        </div>

                        <div className="hotel_page_main_info_menu_container">
                            <ul className="hotel_page_main_info_menu">
                                <li className="hotel_page_main_info_menu_item">
                                    <a className="hotel_page_main_info_menu_item_link" href="#about">
                                        ذرباره هتل
                                </a>
                                </li>
                                <li className="hotel_page_main_info_menu_item">
                                    <a className="hotel_page_main_info_menu_item_link" href="#rooms">
                                        اتاق های موجود
                                </a>
                                </li>
                                <li className="hotel_page_main_info_menu_item">
                                    <a className="hotel_page_main_info_menu_item_link" href="#lacation">
                                        موقعیت مکانی
                                </a>
                                </li>
                                <li className="hotel_page_main_info_menu_item">
                                    <a className="hotel_page_main_info_menu_item_link" href="#facilities">
                                        امکانات هتل
                                </a>

                                </li>
                                <li className="hotel_page_main_info_menu_item">
                                    <a className="hotel_page_main_info_menu_item_link" href="#mandatory-fee">
                                        هزینه های جانبی
                                </a>
                                </li>
                                <li className="hotel_page_main_info_menu_item">
                                    <a className="hotel_page_main_info_menu_item_link" href="#instructions">
                                        نکات ضروری
                                </a>

                                </li>
                            </ul>

                        </div>

                        <div className="hotel_page_main_info_about_container" id="about">
                            <div style={{ display: "inlineBlock" }}>
                                <svg style={{ display: "inline" }} viewBox="0 0 24 24" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink" width="25px" className=""><g transform="translate(-44.000000, 0.000000)"><path d="M54,23 L67,23 L67,3 C67,2.44771525 66.5522847,2 66,2 L55,2 C54.4477153,2 54,2.44771525 54,3 L54,23 Z M55,1 L66,1 C67.1045695,1 68,1.8954305 68,3 L68,24 L53,24 L53,3 C53,1.8954305 53.8954305,1 55,1 Z M59.5,0 C59.7761424,-5.07265313e-17 60,0.223857625 60,0.5 L60,1.5 C60,1.77614237 59.7761424,2 59.5,2 C59.2238576,2 59,1.77614237 59,1.5 L59,0.5 C59,0.223857625 59.2238576,5.07265313e-17 59.5,0 Z M56.5,0 C56.7761424,-5.07265313e-17 57,0.223857625 57,0.5 L57,1.5 C57,1.77614237 56.7761424,2 56.5,2 C56.2238576,2 56,1.77614237 56,1.5 L56,0.5 C56,0.223857625 56.2238576,5.07265313e-17 56.5,0 Z M63,0 L64,0 C64.5522847,-1.01453063e-16 65,0.44771525 65,1 C65,1.55228475 64.5522847,2 64,2 L63,2 C62.4477153,2 62,1.55228475 62,1 C62,0.44771525 62.4477153,1.01453063e-16 63,0 Z M61,24 L61,22.5 C61,22.2238576 60.7761424,22 60.5,22 C60.2238576,22 60,22.2238576 60,22.5 L60,24 L59,24 L59,22.5 C59,21.6715729 59.6715729,21 60.5,21 C61.3284271,21 62,21.6715729 62,22.5 L62,24 L61,24 Z M56.5,4 L59.5,4 C59.7761424,4 60,4.22385763 60,4.5 C60,4.77614237 59.7761424,5 59.5,5 L56.5,5 C56.2238576,5 56,4.77614237 56,4.5 C56,4.22385763 56.2238576,4 56.5,4 Z M61.5,4 L64.5,4 C64.7761424,4 65,4.22385763 65,4.5 C65,4.77614237 64.7761424,5 64.5,5 L61.5,5 C61.2238576,5 61,4.77614237 61,4.5 C61,4.22385763 61.2238576,4 61.5,4 Z M56.5,7 L59.5,7 C59.7761424,7 60,7.22385763 60,7.5 C60,7.77614237 59.7761424,8 59.5,8 L56.5,8 C56.2238576,8 56,7.77614237 56,7.5 C56,7.22385763 56.2238576,7 56.5,7 Z M61.5,7 L64.5,7 C64.7761424,7 65,7.22385763 65,7.5 C65,7.77614237 64.7761424,8 64.5,8 L61.5,8 C61.2238576,8 61,7.77614237 61,7.5 C61,7.22385763 61.2238576,7 61.5,7 Z M56.5,10 L59.5,10 C59.7761424,10 60,10.2238576 60,10.5 C60,10.7761424 59.7761424,11 59.5,11 L56.5,11 C56.2238576,11 56,10.7761424 56,10.5 C56,10.2238576 56.2238576,10 56.5,10 Z M61.5,10 L64.5,10 C64.7761424,10 65,10.2238576 65,10.5 C65,10.7761424 64.7761424,11 64.5,11 L61.5,11 C61.2238576,11 61,10.7761424 61,10.5 C61,10.2238576 61.2238576,10 61.5,10 Z M56.5,13 L59.5,13 C59.7761424,13 60,13.2238576 60,13.5 C60,13.7761424 59.7761424,14 59.5,14 L56.5,14 C56.2238576,14 56,13.7761424 56,13.5 C56,13.2238576 56.2238576,13 56.5,13 Z M61.5,13 L64.5,13 C64.7761424,13 65,13.2238576 65,13.5 C65,13.7761424 64.7761424,14 64.5,14 L61.5,14 C61.2238576,14 61,13.7761424 61,13.5 C61,13.2238576 61.2238576,13 61.5,13 Z M56.5,16 L59.5,16 C59.7761424,16 60,16.2238576 60,16.5 C60,16.7761424 59.7761424,17 59.5,17 L56.5,17 C56.2238576,17 56,16.7761424 56,16.5 C56,16.2238576 56.2238576,16 56.5,16 Z M61.5,16 L64.5,16 C64.7761424,16 65,16.2238576 65,16.5 C65,16.7761424 64.7761424,17 64.5,17 L61.5,17 C61.2238576,17 61,16.7761424 61,16.5 C61,16.2238576 61.2238576,16 61.5,16 Z M56.5,19 L59.5,19 C59.7761424,19 60,19.2238576 60,19.5 C60,19.7761424 59.7761424,20 59.5,20 L56.5,20 C56.2238576,20 56,19.7761424 56,19.5 C56,19.2238576 56.2238576,19 56.5,19 Z M61.5,19 L64.5,19 C64.7761424,19 65,19.2238576 65,19.5 C65,19.7761424 64.7761424,20 64.5,20 L61.5,20 C61.2238576,20 61,19.7761424 61,19.5 C61,19.2238576 61.2238576,19 61.5,19 Z M45,23 L53,23 L53,8 L46,8 C45.4477153,8 45,8.44771525 45,9 L45,23 Z M46,7 L54,7 L54,24 L44,24 L44,9 C44,7.8954305 44.8954305,7 46,7 Z M47.5,4 C47.7761424,4 48,4.22385763 48,4.5 L48,7.5 C48,7.77614237 47.7761424,8 47.5,8 C47.2238576,8 47,7.77614237 47,7.5 L47,4.5 C47,4.22385763 47.2238576,4 47.5,4 Z M50.5,6 C50.7761424,6 51,6.22385763 51,6.5 L51,7.5 C51,7.77614237 50.7761424,8 50.5,8 C50.2238576,8 50,7.77614237 50,7.5 L50,6.5 C50,6.22385763 50.2238576,6 50.5,6 Z M50.5,10 C50.7761424,10 51,10.2238576 51,10.5 C51,10.7761424 50.7761424,11 50.5,11 C50.2238576,11 50,10.7761424 50,10.5 C50,10.2238576 50.2238576,10 50.5,10 Z M47.5,10 L48.5,10 C48.7761424,10 49,10.2238576 49,10.5 C49,10.7761424 48.7761424,11 48.5,11 L47.5,11 C47.2238576,11 47,10.7761424 47,10.5 C47,10.2238576 47.2238576,10 47.5,10 Z M47.5,13 L48.5,13 C48.7761424,13 49,13.2238576 49,13.5 C49,13.7761424 48.7761424,14 48.5,14 L47.5,14 C47.2238576,14 47,13.7761424 47,13.5 C47,13.2238576 47.2238576,13 47.5,13 Z M50.5,13 C50.7761424,13 51,13.2238576 51,13.5 C51,13.7761424 50.7761424,14 50.5,14 C50.2238576,14 50,13.7761424 50,13.5 C50,13.2238576 50.2238576,13 50.5,13 Z M47.5,16 L48.5,16 C48.7761424,16 49,16.2238576 49,16.5 C49,16.7761424 48.7761424,17 48.5,17 L47.5,17 C47.2238576,17 47,16.7761424 47,16.5 C47,16.2238576 47.2238576,16 47.5,16 Z M50.5,16 C50.7761424,16 51,16.2238576 51,16.5 C51,16.7761424 50.7761424,17 50.5,17 C50.2238576,17 50,16.7761424 50,16.5 C50,16.2238576 50.2238576,16 50.5,16 Z M47.5,19 L48.5,19 C48.7761424,19 49,19.2238576 49,19.5 C49,19.7761424 48.7761424,20 48.5,20 L47.5,20 C47.2238576,20 47,19.7761424 47,19.5 C47,19.2238576 47.2238576,19 47.5,19 Z M50.5,19 C50.7761424,19 51,19.2238576 51,19.5 C51,19.7761424 50.7761424,20 50.5,20 C50.2238576,20 50,19.7761424 50,19.5 C50,19.2238576 50.2238576,19 50.5,19 Z"></path></g></svg>
                            </div>
                            <p className="hotel_page_main_info_section_header">
                                درباره هتل دیوان استانبول Divan Istanbul Hotel
                        </p>

                            <p>


                                در مرکز شهر استانبول هتل لوکس دیوان اقامتی راحت برای میهمانان فراهم می‌کند. این هتل که معماری و طراحی مدرنی دارد در منطقه تقسیم قرار گرفته و از این رو دسترسی بسیار راحتی به جاذبه‌های گردشگری شهر ارائه می‌کند.
                            <br />
                                <br />
                            اتاق‌های بزرگ و جا‌دار هتل به سبکی مدرن و با الهام از فرهنگ سنتی ترک چیدمان شده‌اند. تمامی اتاق‌ها دارای امکاناتی چون تهویه‌مطبوع، تلویزیون ال‌سی‌دی، مینی‌بار، میز و صندلی، فضای نشیمن و حمام اختصاصی به همره سشوار و لوازم‌بهداشتی می‌باشد.
                            <br />
                                <br />
                            رستوران «دیوان پاب» با منو کاملی از غذاهای ترکی و بین‌المللی آماده پذیرایی می‌باشد. میهمانان می‌توانند از صرف غذاهای منحصر‌به‌فرد ترکی و مدیترانه‌ای در رستوران شیک «دیوان لوکانتا» لذت ببرند. انواع نوشیدنی و کوکتل هم در «لابی بار» هتل سرو می‌شود. رستوران ژاپنی «مارومی» هم منتخبی از بهترین غذاهای ژاپنی را ارائه می‌کند. همچنین انواع شیرینی و شکلات‌های خوشمزه هم در «شیرینی فروشی دیوان» موجود می‌باشد.
                            <br />
                                <br />
                            بعد از ورزش در سالن بدنسازی مجهز و یا شنا در استخر سرپوشیده حرفه‌ای هتل میهمانان می‌توانند از حمام ترکی و یا سونا استفاده کنند. انواع ماساژ هم در مرکز اسپا هتل ارائه می‌شود. از دیگر امکانات رفاهی هتل دیوان می‌توان به اینترنت وای‌فای، پارکینگ، تراس، میز راهنمای تور، خدمات خشک‌شویی و اتوکشی، امکان کرایه اتومبیل، امکان تبدیل ارز، انبار چمدان و خدمات کانسیرج اشاره کرد. پذیرش هم به‌صورت ۲۴‌ساعته آماده پاسخگویی می‌باشد. (لازم به ذکر است هریک از موارد فوق ممکن است مشمول پرداخت هزینه جداگانه باشند)

                        </p>


                        </div>

                        <div className="hotel_page_main_info_rooms_container" id="rooms">
                            <div className="hotel_page_main_info_section_header_container">
                                <svg fill="" width="32px" height="32px" viewBox="0 0 16 16" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink" className="svg-icon" data-v-285158da=""><defs><path d="M1.99998791,10.6666667 L13.9999154,10.6666667 L13.9999154,8 C13.9999154,7.26362033 13.4029653,6.66666667 12.6665901,6.66666667 L3.33331318,6.66666667 C2.59693797,6.66666667 1.99998791,7.26362033 1.99998791,8 L1.99998791,10.6666667 Z M7.99995164,6 L12.6665901,6 C13.7711529,6 14.666578,6.8954305 14.666578,8 L14.666578,11.3333333 L1.33332527,11.3333333 L1.33332527,8 C1.33332527,6.8954305 2.22875036,6 3.33331318,6 L7.99995164,6 Z M6.66662637,10.6666667 L6.66662637,10 C6.66662637,9.63181017 6.36815134,9.33333333 5.99996373,9.33333333 L4.66663846,9.33333333 C4.29845085,9.33333333 3.99997582,9.63181017 3.99997582,10 L3.99997582,10.6666667 L6.66662637,10.6666667 Z M4.66663846,8.66666667 L5.99996373,8.66666667 C6.73633895,8.66666667 7.333289,9.26362033 7.333289,10 L7.333289,11.3333333 L3.33331318,11.3333333 L3.33331318,10 C3.33331318,9.26362033 3.93026324,8.66666667 4.66663846,8.66666667 Z M11.9999275,10.6666667 L11.9999275,10 C11.9999275,9.63181017 11.7014524,9.33333333 11.3332648,9.33333333 L9.99993955,9.33333333 C9.63175194,9.33333333 9.33327691,9.63181017 9.33327691,10 L9.33327691,10.6666667 L11.9999275,10.6666667 Z M9.99993955,8.66666667 L11.3332648,8.66666667 C12.06964,8.66666667 12.6665901,9.26362033 12.6665901,10 L12.6665901,11.3333333 L8.66661428,11.3333333 L8.66661428,10 C8.66661428,9.26362033 9.26356434,8.66666667 9.99993955,8.66666667 Z M1.99998791,11.3333333 C1.2636127,11.3333333 0.666662637,11.930287 0.666662637,12.6666667 C0.666662637,13.4030463 1.2636127,14 1.99998791,14 L13.9999154,14 C14.7362906,14 15.3332406,13.4030463 15.3332406,12.6666667 C15.3332406,11.930287 14.7362906,11.3333333 13.9999154,11.3333333 L1.99998791,11.3333333 Z M2.66665055,14.6666667 L1.99998791,14.6666667 C0.895425087,14.6666667 1.35269933e-16,13.7712362 0,12.6666667 C-1.35269933e-16,11.5620972 0.895425087,10.6666667 1.99998791,10.6666667 L13.9999154,10.6666667 C15.1044782,10.6666667 15.9999033,11.5620972 15.9999033,12.6666667 C15.9999033,13.7712362 15.1044782,14.6666667 13.9999154,14.6666667 L13.3332527,14.6666667 L13.3332527,15.6666687 C13.3332527,15.8507625 13.1840152,16 12.9999214,16 C12.8158276,16 12.6665901,15.8507625 12.6665901,15.6666687 L12.6665901,14.6666667 L3.33331318,14.6666667 L3.33331318,15.6666687 C3.33331318,15.8507625 3.18407567,16 2.99998187,16 C2.81588806,16 2.66665055,15.8507625 2.66665055,15.6666687 L2.66665055,14.6666667 Z M5.18490415,4.34154953 C5.03172884,4.44366702 4.82477365,4.40227573 4.72265678,4.2490995 C4.62053991,4.09592327 4.66193095,3.88896682 4.81510625,3.78684934 L7.07549233,2.27991618 C7.63532129,1.90669461 8.36465283,1.90669461 8.9244818,2.27991618 L11.1848679,3.78684934 C11.3380432,3.88896682 11.3794342,4.09592327 11.2773174,4.2490995 C11.1752005,4.40227573 10.9682453,4.44366702 10.81507,4.34154953 L8.55468391,2.83461637 C8.21878653,2.61068343 7.7811876,2.61068343 7.44529022,2.83461637 L5.18490415,4.34154953 Z M0.506694279,4.94335685 C0.349441618,5.03907644 0.144367559,4.98919326 0.0486485475,4.83193965 C-0.0470704638,4.67468603 0.00281241558,4.46961073 0.160065077,4.37389115 L6.78679779,0.34020337 C7.53200067,-0.113401123 8.46799933,-0.113401123 9.21320221,0.34020337 L15.8399349,4.37389115 C15.9971876,4.46961073 16.0470705,4.67468603 15.9513515,4.83193965 C15.8556324,4.98919326 15.6505584,5.03907644 15.4933057,4.94335685 L8.86657301,0.909669074 C8.33428524,0.585665864 7.66571476,0.585665864 7.13342699,0.909669074 L0.506694279,4.94335685 Z" id="path-1"></path></defs> <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd"><g id="International-Hotel---PDP---cancel-rules-expanded--Desktop" transform="translate(-451.000000, -330.000000)"><g id="Group-12" transform="translate(200.000000, 236.000000)"><g id="Group-13" transform="translate(20.000000, 17.000000)"><g id="Icon-/-Hotel-&amp;-Facilities-/-bed" transform="translate(231.000000, 77.000000)"><mask id="mask-2-bed" fill="white"><use xlinkHref="#path-1"></use></mask> <use id="bed" fill="currentColor" fill-rule="nonzero" xlinkHref="#path-1"></use></g></g></g></g></g></svg>
                                <h3 className="hotel_page_main_info_section_header">
                                    اتاق های قابل رزرو
                            </h3>
                            </div>

                            <p style={{ margin: "20px 0", fontSize: "15px" }}>
                                فیلتر اتاق ها بر اساس وعده غذایی
                        </p>

                            <div className="hotel_page_rooms_filters_container">
                                <a className="hotel_page_rooms_filter">
                                    همه
                            </a>

                                <div className="vertical-break height_45"> </div>

                                <a className="hotel_page_rooms_filter">
                                    <span data-v-00422f60="" className="mealplan no_food"><small style={{ fontSize: "85%" }}>RO</small></span>
                                بدون وعده غذایی

                            </a>

                                <a className="hotel_page_rooms_filter">
                                    <span data-v-00422f60="" className="mealplan with_breakfast"><small style={{ fontSize: "85%" }}>BB</small></span>
                                صبحانه
                            </a>

                            </div>

                            <div className="hotel_page_rooms_container">

                                {this.state.rooms.map((room, index) => {
                                    return (
                                        <div className="hotel_page_room_selection">
                                            <div className="hotel_page_rooms_choices_container">
                                                <div className="hotel_page_choice_room">
                                                    <p className="hotel_page_room_info_title">
                                                        {room.name}
                                                    </p>
                                                    <div className="hotel_page_room_info_detail">
                                                        <div className="hotel_page_room_info_food">
                                                            <span className="mealplan no_food"><small style={{ fontSize: "60%" }}>RO</small></span>
                                                            <p className="hotel_page_room_info_food_type">
                                                                {room.has_breakfast === true ? "همراه وعده غذایی" : "بدون وعده غذایی"}
                                                            </p>
                                                        </div>

                                                        <div className="vertical-break height_30"> </div>

                                                        <div className="hotel_page_room_info_person_container">
                                                            <svg style={{ verticalAlign: "sub", display: "inlineBlock", paddingTop: "5px" }} width="17px" height="17px" viewBox="0 0 24 24" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink" aria-hidden="true" focusable="false" className="room-details__item__icon"><g data-v-920a8654="" fill="currentColor" fill-rule="nonzero"><path data-v-920a8654="" d="M12,10.5 C14.6233526,10.5 16.75,8.37335256 16.75,5.75 C16.75,3.12664744 14.6233526,1 12,1 C9.37664744,1 7.25,3.12664744 7.25,5.75 C7.25,8.37335256 9.37664744,10.5 12,10.5 Z M12,11.5 C8.82436269,11.5 6.25,8.92563731 6.25,5.75 C6.25,2.57436269 8.82436269,0 12,0 C15.1756373,0 17.75,2.57436269 17.75,5.75 C17.75,8.92563731 15.1756373,11.5 12,11.5 Z M22,24 C22,18.4771525 17.5228475,14 12,14 C6.4771525,14 2,18.4771525 2,24 L1,24 C1,17.9248678 5.92486775,13 12,13 C18.0751322,13 23,17.9248678 23,24 L22.5,24 L22,24 Z"></path></g></svg>

                                                            <p className="hotel_page_room_info_person_number">
                                                                {room.adults_number}
                                                            </p>
                                                            <p className="hotel_page_room_info_person_type">
                                                                بزرگسال
                                                    </p>

                                                        </div>

                                                        <div className="vertical-break height_30"> </div>

                                                        <div className="hotel_page_room_info_price_container">
                                                            <p className="hotel_page_room_info_price_description">
                                                                قیمت برای یک شب:
                                                    </p>

                                                            <p className="hotel_page_room_info_price">
                                                                {room.total}
                                                            </p>

                                                            <p className="hotel_page_room_info_price_unit">
                                                                ریال
                                                    </p>

                                                        </div>

                                                        <div className="vertical-break height_30"> </div>

                                                        <div className="hotel_page_room_info_cancel_container">
                                                            <a>
                                                                <p className="hotel_page_room_info_cancel">
                                                                    قوانین کنسلی
                                                        </p>

                                                            </a>
                                                        </div>

                                                    </div>
                                                </div>
                                            </div>
                                            <div className="hotel_page_room_reserve">
                                                <div className="hotel_page_room_reserve_info_container">
                                                    <p className="hotel_page_room_reserve_info_total_price_description">
                                                        جمع قیمت برای
                                                                            </p>
                                                    <div className="hotel_page_room_reserve_info_total_nights">
                                                        1 شب
                                                                            </div>

                                                    <div className="hotel_page_room_reserve_info_total_price">
                                                        29,062,000
                                                                            </div>

                                                    <div className="hotel_page_room_reserve_info_price_unit">
                                                        ریال
                                                                            </div>
                                                </div>

                                                <a className="hotel_page_room_reserve_button">
                                                    رزرو این اتاق
                                                                        </a>
                                            </div>
                                        </div>
                                    )
                                })}
                            </div>

                        </div>

                        <div className="hotel_page_main_info_facilities_container" id="facilities">
                            <div className="hotel_page_main_info_section_header_container">
                                <svg xmlnsXlink="http://www.w3.org/1999/xlink" height="32px" width="32px" fill="" xmlns="http://www.w3.org/2000/svg" version="1.1" viewBox="0 0 32 32" className="svg-icon" data-v-1150f8fd=""><g id="Detail" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd"><g id="PDP-Desktop---POI-and-amenities" transform="translate(-1371.000000, -2673.000000)" stroke="#242424" stroke-width="2"><g id="Group-3-Copy" transform="translate(1257.000000, 2674.000000)"><path d="M130,25.2638464 L121.631467,29.898864 C121.052464,30.2198653 120.359461,29.7308634 120.467462,29.0768609 L122.075468,19.1978232 L115.224941,12.1642964 C114.776439,11.7007946 115.03594,10.9222917 115.673443,10.8247913 L125.10098,9.38178578 L129.281497,0.456751742 C129.567998,-0.152250581 130.432002,-0.152250581 130.718503,0.456751742 L134.89902,9.38178578 L144.326557,10.8247913 C144.96406,10.9222917 145.223561,11.7007946 144.775059,12.1642964 L137.924532,19.1978232 L139.532538,29.0768609 C139.640539,29.7308634 138.947536,30.2198653 138.368533,29.898864 L130,25.2638464 Z" id="star"></path></g></g></g></svg>
                                <h3 className="hotel_page_main_info_section_header">
                                    امکانات هتل
                            </h3>
                            </div>

                            <ul className="hotel_page_facilities">
                                <li className="hotel_page_facility">
                                    <div className="hotel_page_facility_icon">
                                        <svg xmlnsXlink="http://www.w3.org/1999/xlink" height="36px" width="36px" fill="" xmlns="http://www.w3.org/2000/svg" version="1.1" viewBox="0 0 24 24" className="svg-icon" data-v-539448ea="" data-v-1150f8fd=""><g id="General" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd"><path d="M12,1.5 C17.7989899,1.5 22.5,6.20101013 22.5,12 C22.5,17.7989899 17.7989899,22.5 12,22.5 C6.20101013,22.5 1.5,17.7989899 1.5,12 C1.5,6.20101013 6.20101013,1.5 12,1.5 Z M12,2.5 C6.75329488,2.5 2.5,6.75329488 2.5,12 C2.5,17.2467051 6.75329488,21.5 12,21.5 C17.2467051,21.5 21.5,17.2467051 21.5,12 C21.5,6.75329488 17.2467051,2.5 12,2.5 Z M12,17 C12.2454599,17 12.4496084,17.1768752 12.4919443,17.4101244 L12.5,17.5 L12.5,18 C12.5,18.2761424 12.2761424,18.5 12,18.5 C11.7545401,18.5 11.5503916,18.3231248 11.5080557,18.0898756 L11.5,18 L11.5,17.5 C11.5,17.2238576 11.7238576,17 12,17 Z M12,5.5 C12.2454599,5.5 12.4496084,5.67687516 12.4919443,5.91012437 L12.5,6 L12.5,15 C12.5,15.2761424 12.2761424,15.5 12,15.5 C11.7545401,15.5 11.5503916,15.3231248 11.5080557,15.0898756 L11.5,15 L11.5,6 C11.5,5.72385763 11.7238576,5.5 12,5.5 Z" id="Combined-Shape" fill="#757575" fill-rule="nonzero"></path></g></svg>
                                    </div>
                                    <div className="hotel_page_facility_title_and_items">
                                        <div className="hotel_page_facility_title">
                                            کلی
                                    </div>
                                        <ul className="hotel_page_facility_items">
                                            {public_spaces ? public_spaces.map((space, index) => {
                                                return (
                                                    <li className="hotel_page_facility_item">
                                                        {space}
                                                    </li>
                                                )
                                            }) : null}
                                        </ul>
                                    </div>
                                </li>

                                <li className="hotel_page_facility">
                                    <div className="hotel_page_facility_icon">
                                        <svg xmlnsXlink="http://www.w3.org/1999/xlink" height="36px" width="36px" fill="" xmlns="http://www.w3.org/2000/svg" version="1.1" viewBox="0 0 24 24" className="svg-icon" data-v-539448ea="" data-v-1150f8fd=""><g id="facilities-facilities" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd"><path d="M8.91126971,12.3000016 C9.97913136,12.3027134 11.0068387,12.7073226 11.7388814,13.3918977 C11.9927747,13.5716199 12.2891205,13.682076 12.550025,13.71 L12.550025,13.71 L15.4811934,13.7102797 C16.347187,13.7303258 17.16,14.1066282 17.1534915,15.1295876 L17.1534915,15.1295876 L17.2011134,15.0869976 C17.3044661,14.9831171 17.4020338,14.8687544 17.4932969,14.7439242 L17.4932969,14.7439242 L17.6253981,14.5488302 L18.9364266,13.0665844 C19.2303462,12.76243 19.624014,12.5708513 20.0483554,12.5291128 C20.5257394,12.482157 21.0019952,12.6287722 21.3774653,12.9421555 C22.1790405,13.636854 22.0556295,14.6350315 21.2897545,15.6331956 C21.0713754,15.9049562 20.9234868,16.0945268 20.7946445,16.2678126 L20.7946445,16.2678126 L19.935063,17.4695956 L19.1890591,18.4712505 C18.0486591,19.9819102 16.894031,20.577824 15.9458394,20.6101826 L15.9458394,20.6101826 L8.58923427,20.6101298 C8.68348201,21.2221625 8.38826753,21.8531641 7.80460448,22.1667134 L7.80460448,22.1667134 L5.56595082,23.2922934 L1.33061406,14.7769198 L3.56559561,13.6531861 C4.22603692,13.3214911 5.01533828,13.5233612 5.44190754,14.0973779 L5.72502105,13.8635357 C5.92540649,13.7026206 6.13417451,13.5439854 6.34825062,13.3921584 C6.74698014,13.1093715 7.13673049,12.8698784 7.51048794,12.6870941 C8.01920873,12.4383065 8.48524634,12.3000016 8.91126971,12.3000016 Z M4.68440439,14.7668139 C4.55961657,14.5216574 4.26023116,14.4233518 4.01460448,14.5467134 L4.01460448,14.5467134 L2.669,15.222 L6.013,21.948 L7.34327829,21.2795879 C7.55531523,21.1656179 7.65243741,20.9200066 7.58444568,20.693833 L7.58444568,20.693833 L7.55111102,20.6102242 Z M8.91,13.3 C8.66279728,13.3 8.33379095,13.3976396 7.94981154,13.5854229 C7.62986294,13.7418923 7.28457911,13.9540617 6.92674938,14.2078416 C6.63098855,14.4176011 6.34390951,14.6432922 6.07763585,14.8689478 L6.07763585,14.8689478 L6.01,14.925 L8.198,19.61 L15.9286411,19.6104789 C16.5242243,19.5899671 17.3365525,19.1866548 18.2320717,18.0727619 L18.2320717,18.0727619 L18.3909409,17.8687495 C18.6273307,17.5556098 18.8275799,17.2874211 19.0014105,17.0515576 L19.0014105,17.0515576 L19.3520494,16.5700875 L19.9905019,15.6733581 C20.0452098,15.5997417 20.1027647,15.5238583 20.1663084,15.441672 L20.1663084,15.441672 L20.5032843,15.0156702 C20.9803327,14.3938035 21.0331009,13.9670019 20.7296804,13.703921 C20.5671238,13.568294 20.3569327,13.5035867 20.1462436,13.5243102 C19.9355546,13.5450337 19.741999,13.6494538 19.5946019,13.8311698 L19.5946019,13.8311698 L18.4264008,15.1411175 C17.9686094,15.8886838 17.254463,16.4395772 16.4027936,16.7000251 L16.4027936,16.7000251 L16.2686002,16.7354441 C15.6780164,16.8913227 15.376795,16.0543184 15.9312727,15.7981118 L15.9312727,15.7981118 L15.9723403,15.771345 L16.0189038,15.731882 C16.1377823,15.6179984 16.1929844,15.4528951 16.16,15.21 L16.16,15.21 L16.1506458,15.112984 C16.0953376,14.839076 15.8021678,14.7179642 15.4695974,14.7101458 L15.4695974,14.7101458 L12.5012933,14.707622 C12.0187538,14.6603915 11.5568517,14.488228 11.1100636,14.1666651 C10.5112243,13.6114791 9.72533038,13.3020721 8.91,13.3 Z M16.0937474,3.38131343 C16.642775,2.73434482 17.4959368,2.39961602 18.3583007,2.52496877 L18.3583007,2.52496877 L18.5308088,2.55621755 C19.6805155,2.80602293 20.5004611,3.82366388 20.4999997,5 C20.4999997,5.98921566 19.7764733,7.29449672 18.5473757,8.86408751 C18.1194709,9.41053355 17.6538187,9.95610174 17.1766728,10.481607 C16.9671009,10.7124193 16.776238,10.9165527 16.6116994,11.0883965 L16.6116994,11.0883965 L16.3551073,11.3519925 C16.1601014,11.5487241 15.8423171,11.5494241 15.6464465,11.3535534 C15.5539726,11.2610795 15.4136186,11.1166565 15.2367099,10.9287347 L15.2367099,10.9287347 L14.650902,10.2903478 C14.2951579,9.89254735 13.9437137,9.48003284 13.6095654,9.06234752 C13.239959,8.60033945 12.9074526,8.15145579 12.6210117,7.72179454 C11.9032315,6.64512419 11.4999997,5.73785296 11.4999997,5.00019588 C11.499539,3.82366374 12.3194846,2.80602291 13.4691912,2.55621755 C14.3889566,2.35637325 15.3206231,2.69121358 15.9036926,3.37586528 L15.9036926,3.37586528 L15.9999997,3.498 Z M18.3184853,3.53341699 C17.6286613,3.38353377 16.9276799,3.73491738 16.635,4.37730404 L16.635,4.37730404 L16.5803548,4.47424731 C16.4514921,4.66538757 16.234785,4.78282202 15.9999996,4.78282202 C15.7316741,4.78282202 15.4869605,4.62943811 15.365,4.37730404 C15.0723201,3.73491738 14.3713387,3.38353377 13.6815147,3.53341699 C12.9916907,3.68330021 12.4997233,4.29388476 12.4999996,5 C12.4999996,5.48436926 12.8375089,6.2437647 13.453062,7.16709435 C13.7221768,7.57076643 14.0378185,7.99688277 14.3904342,8.43765248 C14.8199032,8.97448872 15.2811239,9.50489252 15.7424016,10.0046099 L15.7424016,10.0046099 L15.9999996,10.28 L16.4363219,9.80938644 C16.8981869,9.30071074 17.348467,8.77315286 17.7600466,8.24755463 C18.8503492,6.85520869 19.4999996,5.6832038 19.4999996,4.99980396 C19.5002767,4.29388474 19.0083093,3.68330022 18.3184853,3.53341699 Z" id="Combined-Shape" fill="#757575" fill-rule="nonzero"></path></g></svg>                        </div>

                                    <div className="hotel_page_facility_title_and_items">
                                        <div className="hotel_page_facility_title">
                                            خدمات دهی هتل
                                    </div>
                                        <ul className="hotel_page_facility_items">
                                            {customer_services ? customer_services.map((customer, index) => {
                                                return (
                                                    <li className="hotel_page_facility_item">
                                                        {customer}
                                                    </li>
                                                )
                                            }) : null}
                                        </ul>
                                    </div>
                                </li>

                                <li className="hotel_page_facility">
                                    <div className="hotel_page_facility_icon">
                                        <svg xmlnsXlink="http://www.w3.org/1999/xlink" height="36px" width="36px" fill="" xmlns="http://www.w3.org/2000/svg" version="1.1" viewBox="0 0 24 24" className="svg-icon" data-v-539448ea="" data-v-1150f8fd=""><g id="Food-Drink" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd"><path d="M22.0321219,3.50094585 L22.1212678,3.51492875 C22.3593989,3.57446152 22.5145535,3.79556891 22.4990541,4.03212186 L22.4850713,4.12126781 L20.4850713,12.1212678 C20.4363811,12.3160284 20.2771763,12.4599248 20.0844332,12.4928558 L20,12.5 L19.5868817,12.4998817 L20.493197,17.9378005 C20.5385945,18.2101857 20.3545847,18.4677994 20.0821995,18.513197 C19.8400794,18.5535503 19.6096304,18.4126435 19.5295246,18.1895279 L19.506803,18.1021995 L18.5718817,12.4998817 L17.3018817,12.4998817 L18.4916084,18.9087793 C18.52413,19.0840458 18.4607502,19.2608813 18.3299673,19.3756927 L18.2590909,19.4276352 C17.0487694,20.1609314 15.5312306,20.1609314 14.28,19.4 L14.4608817,19.5018817 L13.5112195,19.9177234 C12.6803232,20.2829932 11.7507561,20.3351747 10.8824458,20.0700348 L10.666737,19.9971365 L10.4541359,19.9110019 L9.519,19.463 L9.36559116,19.5417787 C8.27480179,20.0544249 6.99817097,20.0202485 5.93216046,19.4392495 L5.93216046,19.4392495 L5.73484848,19.3239041 C5.56042448,19.2148021 5.47063433,19.0099953 5.50857641,18.8077891 L5.50857641,18.8077891 L6.69088172,12.4998817 L5.42388172,12.4998817 L4.49324118,18.1019338 C4.44799042,18.3743433 4.19047583,18.5584919 3.91806625,18.5132412 C3.6759244,18.4730183 3.50351961,18.2650808 3.4999779,18.028047 L3.50675882,17.9380662 L4.40888172,12.4998817 L4,12.5 C3.79924541,12.5 3.62103255,12.3804487 3.54233774,12.2014473 L3.51492875,12.1212678 L1.51492875,4.12126781 C1.44795439,3.85337036 1.61083473,3.58190311 1.87873219,3.51492875 C2.11686326,3.45539598 2.3578149,3.57747681 2.45545806,3.7934938 L2.48507125,3.87873219 L4.39,11.5 L6.87888172,11.4998817 L7.17857641,9.90778906 C7.21739892,9.70089066 7.38033265,9.54385096 7.58163061,9.50782382 L7.67,9.5 L16.33,9.5 C16.5709616,9.5 16.777647,9.67186189 16.8216084,9.90877934 L16.8216084,9.90877934 L17.1158817,11.4998817 L19.609,11.5 L21.5149287,3.87873219 C21.5670199,3.6703675 21.7428167,3.52553168 21.9444239,3.50296176 L22.0321219,3.50094585 Z M15.914,10.5 L8.084,10.5 L6.558,18.634 L6.61629925,18.6625309 C7.39782069,19.0087673 8.30044504,18.9799143 9.06178267,18.5759718 L8.99988172,18.6048817 L9,15.87 C9,15.5938576 9.22385763,15.37 9.5,15.37 C9.74545989,15.37 9.94960837,15.5468752 9.99194433,15.7801244 L10,15.87 L9.99988172,18.5848817 L10.8712195,19.0022766 C11.5193373,19.2871953 12.2490851,19.313097 12.9128051,19.0796484 L13.1097926,19.001833 L13.9998817,18.6118817 L14,14.06 C14,13.7838576 14.2238576,13.56 14.5,13.56 C14.7454599,13.56 14.9496084,13.7368752 14.9919443,13.9701244 L15,14.06 L15.0000391,18.6627884 C15.7404519,19.0472894 16.6109218,19.0795856 17.3731828,18.7596769 L17.3731828,18.7596769 L17.441,18.728 L16.2102367,12.1011503 C16.2088668,12.0944823 16.2076296,12.0877658 16.206528,12.0810037 L15.914,10.5 Z M12,4.96 C12.2400453,4.96 12.4405817,5.12915791 12.4889078,5.35477235 C14.1461995,5.59198354 15.42,7.01723575 15.42,8.74 C15.42,9.01614237 15.1961424,9.24 14.92,9.24 L14.92,9.24 L9.08,9.24 C8.80385763,9.24 8.58,9.01614237 8.58,8.74 C8.58,7.01688982 9.85431207,5.59141116 11.5119388,5.35456139 C11.5594183,5.12915791 11.7599547,4.96 12,4.96 Z M12,6.32000006 C10.8773156,6.32000006 9.93318898,7.08449712 9.6598092,8.12130229 L9.6598092,8.12130229 L9.632,8.24 L14.367,8.24 L14.3401908,8.12130229 C14.0798291,7.13386879 13.2110803,6.39342678 12.1591157,6.32514758 L12.1591157,6.32514758 Z" id="Combined-Shape" fill="#757575" fill-rule="nonzero"></path></g></svg>                        </div>
                                    <div className="hotel_page_facility_title_and_items">
                                        <div className="hotel_page_facility_title">
                                            خوردنی و آشامیدنی
                                    </div>
                                        <ul className="hotel_page_facility_items">
                                            {foods_and_drinks ? foods_and_drinks.map((food, index) => {
                                                return (
                                                    <li className="hotel_page_facility_item">
                                                        {food}
                                                    </li>
                                                )
                                            }) : null}
                                        </ul>
                                    </div>
                                </li>

                                <li className="hotel_page_facility">
                                    <div className="hotel_page_facility_icon">
                                        <svg xmlnsXlink="http://www.w3.org/1999/xlink" height="36px" width="36px" fill="" xmlns="http://www.w3.org/2000/svg" version="1.1" viewBox="0 0 24 24" className="svg-icon" data-v-539448ea="" data-v-1150f8fd=""><g id="Pool-and-Wellness" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd"><path d="M22.4469258,19.7758186 C22.5569809,19.9952233 22.4904134,20.257006 22.3009051,20.3994283 L22.2241814,20.4469258 L19.1125,22.0077653 C18.4701085,22.3269774 17.7246756,22.3535784 17.064258,22.0871434 L16.8863932,22.0072136 L15.56625,21.347142 C14.6460824,20.8866898 13.5736285,20.8559929 12.6330397,21.2551098 L12.4336068,21.3472136 L11.1125,22.0077653 C10.4701085,22.3269774 9.7246756,22.3535784 9.06425799,22.0871434 L8.8863932,22.0072136 L7.56625,21.347142 C6.64608237,20.8866898 5.57362854,20.8559929 4.63238067,21.2554385 L4.43279626,21.3476179 L2.22279626,22.4476179 C1.9755837,22.5706649 1.67542903,22.4700088 1.55238205,22.2227963 C1.44300696,22.0030518 1.51038492,21.7414765 1.70033339,21.5996417 L1.77720374,21.5523821 L3.98625,20.452858 C5.17926445,19.8558732 6.57137997,19.8207564 7.78769869,20.347448 L8.0136068,20.4527864 L9.3325,21.1122347 C9.70625508,21.2979581 10.1381448,21.3185941 10.5240413,21.17453 L10.6663932,21.1127864 L11.98625,20.452858 C13.1792644,19.8558732 14.57138,19.8207564 15.7876987,20.347448 L16.0136068,20.4527864 L17.3325,21.1122347 C17.7062551,21.2979581 18.1381448,21.3185941 18.5236377,21.1747321 L18.6658186,21.1130742 L21.7758186,19.5530742 C22.0226489,19.4292622 22.3231138,19.5289883 22.4469258,19.7758186 Z M22.4469258,15.7758186 C22.5569809,15.9952233 22.4904134,16.257006 22.3009051,16.3994283 L22.2241814,16.4469258 L19.1125,18.0077653 C18.4701085,18.3269774 17.7246756,18.3535784 17.064258,18.0871434 L16.8863932,18.0072136 L15.56625,17.347142 C14.6460824,16.8866898 13.5736285,16.8559929 12.6330397,17.2551098 L12.4336068,17.3472136 L11.1125,18.0077653 C10.4701085,18.3269774 9.7246756,18.3535784 9.06425799,18.0871434 L8.8863932,18.0072136 L7.56625,17.347142 C6.64608237,16.8866898 5.57362854,16.8559929 4.63238067,17.2554385 L4.43279626,17.3476179 L2.22279626,18.4476179 C1.9755837,18.5706649 1.67542903,18.4700088 1.55238205,18.2227963 C1.44300696,18.0030518 1.51038492,17.7414765 1.70033339,17.5996417 L1.77720374,17.5523821 L3.98625,16.452858 C5.17926445,15.8558732 6.57137997,15.8207564 7.78769869,16.347448 L8.0136068,16.4527864 L9.3325,17.1122347 C9.70625508,17.2979581 10.1381448,17.3185941 10.5240413,17.17453 L10.6663932,17.1127864 L11.98625,16.452858 C13.1792644,15.8558732 14.57138,15.8207564 15.7876987,16.347448 L16.0136068,16.4527864 L17.3325,17.1122347 C17.7062551,17.2979581 18.1381448,17.3185941 18.5236377,17.1747321 L18.6658186,17.1130742 L21.7758186,15.5530742 C22.0226489,15.4292622 22.3231138,15.5289883 22.4469258,15.7758186 Z M12.775,3.10377155 C13.2209923,3.10377155 13.6486816,3.28111075 13.963293,3.59618644 C14.2788893,3.91131836 14.4562284,4.33900773 14.4562284,4.785 C14.4562284,5.17524323 14.3204531,5.55147331 14.0748981,5.85073299 L13.9630148,5.97409111 L11.029,8.9 L17.3530229,15.2059169 L16.6469771,15.9140831 L9.6118226,8.89999192 L13.256707,5.26618644 C13.3844483,5.13863304 13.4562284,4.96552068 13.4562284,4.785 C13.4562284,4.60447932 13.3844483,4.43136696 13.2561864,4.30329303 C13.128633,4.1755517 12.9555207,4.10377155 12.775,4.10377155 C12.6305835,4.10377155 12.4909082,4.14971085 12.3751609,4.23383652 L12.2931367,4.30396958 L8.04460365,8.5425 C7.87228205,8.71584998 7.85313521,8.98397038 7.98642549,9.17764063 L8.04355339,9.24644661 L10.3997591,11.6026523 L6.67090119,15.2761858 L5.96909881,14.5638142 L8.98,11.597 L7.33539635,9.9525 C6.79016004,9.40400983 6.75608277,8.53926154 7.23437326,7.95002821 L7.33686329,7.83603042 L11.5861864,3.59670697 C11.9013184,3.28111075 12.3290077,3.10377155 12.775,3.10377155 Z M16.0608132,6.71382006 L16.2468072,6.71616796 L16.4318626,6.73540175 C16.8597989,6.79981542 17.2586236,7.00042811 17.5843359,7.32579983 L17.5843359,7.32579983 L17.7193223,7.47284981 L17.8218141,7.61989276 C18.400279,8.53205875 18.2147968,9.73783494 17.3846312,10.4302823 L17.3846312,10.4302823 L16.8518347,10.8851934 C16.4629972,11.189982 15.9750738,11.3454357 15.4775652,11.3187834 C14.9178679,11.2887997 14.394856,11.0309532 13.9990211,10.5647741 L13.9990211,10.5647741 L13.8983177,10.4185157 C13.3302151,9.51243051 13.5080557,8.32134398 14.3194847,7.6248205 L14.3194847,7.6248205 L14.7286988,7.26460506 C15.1384419,6.8818799 15.6870638,6.68368285 16.2468072,6.71616796 Z M16.065,7.714 L15.9457977,7.72883896 C15.7465252,7.76437251 15.5581256,7.85816913 15.4005153,8.0051795 L15.4005153,8.0051795 L14.9756832,8.37938171 C14.5356746,8.75711044 14.4397503,9.39956327 14.7329173,9.86813747 L14.7329173,9.86813747 L14.7897514,9.95474799 C14.9765015,10.1727901 15.2443857,10.3048578 15.5310599,10.3202153 C15.8177341,10.3355728 16.0981947,10.2328808 16.3253688,10.0197177 L16.3253688,10.0197177 L16.7397209,9.66604519 C17.1877848,9.29228897 17.2874371,8.64447298 16.9902413,8.17481997 L16.9902413,8.17481997 L16.9287206,8.08345945 C16.7429383,7.86446762 16.4755668,7.73112684 16.2143504,7.71531588 L16.2143504,7.71531588 L16.065,7.714 Z" id="Combined-Shape" fill="#757575" fill-rule="nonzero"></path></g></svg>
                                    </div>
                                    <div className="hotel_page_facility_title_and_items">
                                        <div className="hotel_page_facility_title">
                                            استخر و سالن های ورزشی و بدنسازی
                                    </div>
                                        <ul className="hotel_page_facility_items">
                                            {sports ? sports.map((sport, index) => {
                                                return (
                                                    <li className="hotel_page_facility_item">
                                                        {sport}
                                                    </li>
                                                )
                                            }) : null}
                                        </ul>
                                    </div>
                                </li>
                            </ul>



                        </div>

                        <div className="hotel_page_main_info_mandatory_fee_container" id="mandatory-fee">
                            <div className="hotel_page_main_info_section_header_container">
                                <svg viewBox="0 0 32 26" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink" fill="" width="32px" height="26px" className="svg-icon" data-v-04070e6b=""><g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd"><g id="International-Hotel---PDP---more-than-1-room---Desktop" transform="translate(-1369.000000, -2716.000000)" fill="currentColor" fill-rule="nonzero" stroke="#242424" stroke-width="0.5"><g id="Group-37" transform="translate(500.000000, 2713.000000)"><g id="Group-8" transform="translate(759.000000, 0.000000)"><path d="M111,27.7916667 L111,9 C111,6.25 113.25,4 116,4 L136,4 C138.75,4 141,6.25 141,9 L141,17.75 C141,20.5 138.75,22.75 136,22.75 L117.541667,22.75 L111,27.7916667 Z M116,5.66666667 C114.166667,5.66666667 112.666667,7.16666667 112.666667,9 L112.666667,24.375 L116.958333,21.0833333 L136,21.0833333 C137.833333,21.0833333 139.333333,19.5833333 139.333333,17.75 L139.333333,9 C139.333333,7.16666667 137.833333,5.66666667 136,5.66666667 L116,5.66666667 Z M125.166667,8.82142857 L126.833333,8.82142857 L126.833333,15.3214286 L125.166667,15.3214286 L125.166667,8.82142857 Z M125.166667,16.7380952 L126.833333,16.7380952 L126.833333,18.8214286 L125.166667,18.8214286 L125.166667,16.7380952 Z" id="Combined-Shape"></path></g></g></g></g></svg>
                                <h3 className="hotel_page_main_info_section_header">
                                    هزینه های جانبی
                            </h3>
                            </div>

                            <div className="hotel_page_mandatory_fee_text">
                                You'll be asked to pay the following charges at the property:
                            <br />
                                <br />
                            Deposit: EUR 100.00 per day
                            <br />
                            We have included all charges provided to us by the property. However, charges can vary, for example, based on length of stay or the room you book.
                        </div>
                        </div>

                        <div className="hotel_page_main_info_instructions_container" id="instructions">
                            <div className="hotel_page_main_info_section_header_container">
                                <svg viewBox="0 0 32 26" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink" fill="" width="32px" height="26px" className="svg-icon" data-v-04070e6b=""><g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd"><g id="International-Hotel---PDP---more-than-1-room---Desktop" transform="translate(-1369.000000, -2716.000000)" fill="currentColor" fill-rule="nonzero" stroke="#242424" stroke-width="0.5"><g id="Group-37" transform="translate(500.000000, 2713.000000)"><g id="Group-8" transform="translate(759.000000, 0.000000)"><path d="M111,27.7916667 L111,9 C111,6.25 113.25,4 116,4 L136,4 C138.75,4 141,6.25 141,9 L141,17.75 C141,20.5 138.75,22.75 136,22.75 L117.541667,22.75 L111,27.7916667 Z M116,5.66666667 C114.166667,5.66666667 112.666667,7.16666667 112.666667,9 L112.666667,24.375 L116.958333,21.0833333 L136,21.0833333 C137.833333,21.0833333 139.333333,19.5833333 139.333333,17.75 L139.333333,9 C139.333333,7.16666667 137.833333,5.66666667 136,5.66666667 L116,5.66666667 Z M125.166667,8.82142857 L126.833333,8.82142857 L126.833333,15.3214286 L125.166667,15.3214286 L125.166667,8.82142857 Z M125.166667,16.7380952 L126.833333,16.7380952 L126.833333,18.8214286 L125.166667,18.8214286 L125.166667,16.7380952 Z" id="Combined-Shape"></path></g></g></g></g></svg>
                                <h3 className="hotel_page_main_info_section_header">
                                    نکات ضرروی
                            </h3>
                            </div>

                            <div className="hotel_page_instructions_text">
                                Extra-person charges may apply and vary depending on property policy.
                            <br />
                            Government-issued photo identification and a credit card, debit card, or cash deposit are required at check-in for incidental charges.
                            <br />
                            Special requests are subject to availability upon check-in and may incur additional charges. Special requests cannot be guaranteed.
                            <br />
                            Please note that cultural norms and guest policies may differ by country and by property. The policies listed are provided by the property.
                            <br />
                            Divan Istanbul Hotel dress code is smart casual and guests are asked to refrain from wearing sportswear, trainers, gym outfits, slippers, flip-flops, baggy clothing, and shorts in the restaurants, bar, and lobby loun

                        </div>
                        </div>
                    </div>

                    <div className="hotel_page_buy_container">
                        <div className="hotel_page_buy">
                            <div className="hotel_page_buy_date_container">
                                <div className="hotel_page_buy_arrival_date">
                                    <div style={{ fontSize: "13px" }}>
                                        تاریخ ورود
                                </div>
                                    <div className="hotel_page_buy_passengers">
                                        1399/05/13
                                </div>
                                </div>

                                <div className="vertical-break height_45"></div>

                                <div className="hotel_page_buy_departure_date">
                                    <div style={{ fontSize: "13px" }}>
                                        تاریخ خروج
                                </div>
                                    <div className="hotel_page_buy_passengers">
                                        1399/05/14
                                </div>
                                </div>
                            </div>

                            <div className="hotel_page_buy_passengers_container">
                                <div style={{ fontSize: "13px" }}>
                                    مسافران
                            </div>
                                <div className="hotel_page_buy_passengers">
                                    2 بزرگسال 1 اتاق
                            </div>
                            </div>

                            <div className="hotel_page_buy_price_container">
                                <div className="hotel_page_room_info_price_description">
                                    شروع قیمت ها از
                            </div>
                                <div className="hotel_page_room_reserve_info_total_price">
                                    29,062,000
                            </div>

                                <div className="hotel_page_room_reserve_info_price_unit">
                                    ریال
                            </div>
                            </div>

                            <div style={{ display: "flex", justifyContent: "center" }}>
                                <div className="hotel_page_buy_button">
                                    مشاهده اتاق های موجود
                            </div>
                            </div>

                        </div>
                    </div>

                </div>
            </div>

        )
    }
}

export default withRouter(Hotel);